# flats-in-cracow data wrangling

## Imports

In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

from collections import Counter
from IPython.display import display
from sklearn.impute import KNNImputer
from pylab import rcParams
from pathlib import Path

## Setup

In [2]:
# Create directory for images 
Path("img").mkdir(parents=True, exist_ok=True)

# Set default figure size
rcParams['figure.figsize'] = (4, 4)

# Tell pandas how to display floats
pd.options.display.float_format = "{:,.2f}".format

## Goal

I scraped listings of properties for sale in Cracow. We would like to create a model to predict flat prices.

## Data source

Data has been scraped from a website with listings. The data has undergone small transformations along the way. The goal of these transformations was to get the data into a usable state not to check it's validity.

## Data loading

In [3]:
path = '../flats-data/raw_data.csv'

In [4]:
data = pd.read_csv(path, lineterminator='\n')

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40565 entries, 0 to 40564
Data columns (total 24 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         40463 non-null  object
 1   City         29279 non-null  object
 2   District     22014 non-null  object
 3   Amount       40426 non-null  float64
 4   Currency     40426 non-null  object
 5   Property     40160 non-null  object
 6   Seller       40345 non-null  object
 7   Area         40223 non-null  float64
 8   Rooms        39742 non-null  float64
 9   Bathrooms    25830 non-null  float64
 10  Parking      16867 non-null  object
 11  Garden       40565 non-null  bool
 12  Balcony      40565 non-null  bool
 13  Terrace      40565 non-null  bool
 14  Floor        40565 non-null  bool
 15  New          40565 non-null  bool
 16  Estate       40565 non-null  bool
 17  Townhouse    40565 non-null  bool
 18  Apartment    40565 non-null  bool
 19  Land         40565 non-null  bool
 20  Studio       40565 non-null  bool
 21  Title        40463 non-null  object
 22  Description  35567 non-null  object
 23  Link         40565 non-null  object
dtypes: bool(10), float64(4), object(10)
memory usage: 4.7+ MB

First we sort the data in from newest to oldest, forcing rows with missing `Date` values to be last.

In [6]:
data = data.sort_values(by='Date', 
                        ascending=False, 
                        na_position='last', 
                        ignore_index=True)

Next we assume that the `Title` column uniquely identifies a listing.

In [ ]:
data = data.drop_duplicates(['Title'], keep='first')

After this the shape of the data is:

In [ ]:
print(data.shape)

## Data exploration

We check for missing values that we will have to deal with.

In [8]:
missing = data.isnull().sum(axis=0)
missing.name = 'Missing'
missing = missing.to_frame()
missing = missing[missing['Missing'] > 0]
missing.sort_values('Missing', ascending=False)

             Missing
Parking         4980
District        3270
Bathrooms       3207
City            1751
Description     1272
Rooms            192
Area             104
Seller            67
Property          64
Amount             6
Currency           6
Date               1
Title              1

### Check numeric columns

We see that we have 24 columns at our disposal. 
We inspect the numeric columns to see what we are dealing with. 
In the `Amount` column we note there is a property for sale that costs 1PLN, clearly a erroneous value. 
Next we note that the enourmous maximum in the `Amount` column. That is quite a lot of money and could be considered a potential outlier.
The maximum and minimum of the `Area` column also indicate the existance of outliers. These values are clearly too large. The data will need to undergo a filtering process.

In [9]:
data.describe()

             Amount       Area    Rooms  Bathrooms
count      7,683.00   7,585.00 7,497.00   4,482.00
mean     675,665.66     150.98     2.90       1.33
std      699,692.75   4,162.05     1.32       0.64
min          100.00       1.00     1.00       1.00
25%      395,842.50      43.00     2.00       1.00
50%      500,000.00      56.00     3.00       1.00
75%      720,000.00      80.00     4.00       2.00
max   22,000,000.00 320,000.00     6.00       4.00

### Check binary columns

We inspect the data to see if binary columns are properly populated and check for imbalances.

In [10]:
binary = data.select_dtypes(bool).columns.to_list()

for col in binary:
    tmp = data[[col, 'Amount']]
    tmp = tmp.fillna('NaN')
    tmp = tmp.groupby(col, as_index=False)
    tmp = tmp.count()
    tmp = tmp.rename(columns={'Amount': 'Count'})
    tmp = tmp.sort_values('Count', ascending=False)
    tmp = tmp.reset_index(drop=True)
    display(tmp)

   Garden  Count
0   False   6202
1    True   1487

   Balcony  Count
0    False   5040
1     True   2649

   Terrace  Count
0    False   6779
1     True    910

   Floor  Count
0  False   4685
1   True   3004

     New  Count
0  False   5166
1   True   2523

   Estate  Count
0   False   6562
1    True   1127

   Townhouse  Count
0      False   6998
1       True    691

   Apartment  Count
0      False   6591
1       True   1098

    Land  Count
0  False   5969
1   True   1720

   Studio  Count
0   False   7201
1    True    488

### Check categorical columns

We inspect categorical columns to assert that they contain "valid" values. Most of these columns were generated by a script during the scraping and etl phase of the project.

In [11]:
categorical = data.select_dtypes('object').columns
categorical = categorical.to_list()
omit = ['Title', 'Link', 'Description', 'Date']

for col in categorical:
    if col not in omit:
        tmp = data[['Amount', col]].copy()
        tmp = tmp.fillna('NaN')
        tmp = tmp.groupby(col, as_index=False)
        tmp = tmp.count()
        tmp = tmp.rename(columns={'Amount': 'Count'})
        tmp = tmp.sort_values('Count', ascending=False)
        tmp = tmp.reset_index(drop=True)
        display(tmp)

     City  Count
0  kraków   5938
1     NaN   1751

                 District  Count
0                     NaN   3270
1               krowodrza    603
2            stare miasto    518
3                podgorze    514
4               nowa huta    357
5               bronowice    313
6                 debniki    312
7           pradnik bialy    284
8        pradnik czerwony    223
9              grzegorzki    218
10               biezanow    203
11                czyzyny    176
12          mistrzejowice    139
13             lagiewniki    109
14            zwierzyniec    107
15              bienczyce     95
16     podgorze duchackie     83
17             swoszowice     72
18               prokocim     52
19          borek falecki     26
20  wzgorza krzeslawickie     15

  Currency  Count
0      pln   7683
1      NaN      6

  Property  Count
0     flat   6591
1    house   1034
2      NaN     64

    Seller  Count
0  realtor   7069
1    owner    553
2      NaN     67

      Parking  Count
0         NaN   4980
1      street   1122
2      garage   1015
3  no parking    430
4     covered    142

### Check text columns

We search for keywords in the data.

In [12]:
# text = data[data['Description'].isna() == False].copy()
# text = text['Description'].to_list()
# text = ' '.join(text)
# text = text.split(' ')
# text = [x for x in text if x.isalpha()]
# text = [x for x in text if len(x) > 3]

In [13]:
# for i in range(5, len(text)-5):
#     if 'piętro' in text[i]:    
#         s = text[i-5:i+5]
#         s = ' '.join(s)
#         print(s)

## Data cleaning

We assume that if we know the district, the `City` is `kraków`.

In [14]:
mask = (data['City'].isna() == True) & (data['District'].isna() == False)
data.loc[mask, 'City'] = 'kraków'

We extract more `Parking` information from the property description.

In [15]:
def extract_parking(x):
    if ('garaż' in x or 'garaz' in x or 'parking' in x) and 'podziemny' in x:
        return 'covered'
    elif ('garaż' in x or 'garaz' in x) and 'podziemny' not in x:
        return 'garage'
    elif 'parking' in x and 'podziemny' not in x:
        return 'street'
    else:
        return 'no parking'

In [16]:
mask = (data['Parking'].isna() == True) & (data['Description'].isna() == False)
data.loc[mask, ['Parking', 'Description']] = data.loc[mask, 'Description'].apply(extract_parking)

In [17]:
mask = data['Parking'].isna() == True
data.loc[mask, 'Parking'] = 'no parking'

We confirm that we have dealt with all the `NaN`s in the `Parking` column.

In [18]:
print(data['Parking'].isna().sum())

0

### Filtering

Next we filter the data according to these rules:

In [19]:
data = data[data['City'] == 'kraków']
data = data[data['Currency'] == 'pln']
data = data[data['Property'] == 'flat']
data = data[(data['Amount'] >= data['Amount'].quantile(0.025))]
data = data[(data['Amount'] <= data['Amount'].quantile(0.975))]
data = data[(data['Area'] >= data['Area'].quantile(0.01))]
data = data[(data['Area'] <= data['Area'].quantile(0.99))]
data = data[data['District'] != 'unknown']
data = data[data['District'].isna() == False]
data = data[data['Seller'].isna() == False]
data = data[data['Description'].isna() == False]

In [20]:
data = data.reset_index(drop=True)

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3332 entries, 0 to 3331
Data columns (total 24 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         3332 non-null   object
 1   City         3332 non-null   object
 2   District     3332 non-null   object
 3   Amount       3332 non-null   float64
 4   Currency     3332 non-null   object
 5   Property     3332 non-null   object
 6   Seller       3332 non-null   object
 7   Area         3332 non-null   float64
 8   Rooms        3283 non-null   float64
 9   Bathrooms    1618 non-null   float64
 10  Parking      3332 non-null   object
 11  Garden       3332 non-null   bool
 12  Balcony      3332 non-null   bool
 13  Terrace      3332 non-null   bool
 14  Floor        3332 non-null   bool
 15  New          3332 non-null   bool
 16  Estate       3332 non-null   bool
 17  Townhouse    3332 non-null   bool
 18  Apartment    3332 non-null   bool
 19  Land         3332 non-null   bool
 20  Studio       3332 non-null   bool
 21  Title        3332 non-null   object
 22  Description  3332 non-null   object
 23  Link         3332 non-null   object
dtypes: bool(10), float64(4), object(10)
memory usage: 397.1+ KB

### Impute missing values

The next step is to fill in missing values for numeric columns `Amount` `Area` `Rooms` and `Bathrooms`. We use the KNN algorithm to accomplish this.

In [22]:
numeric = list(data.select_dtypes('number').columns)

In [23]:
mask = (data['Bathrooms'].isna() == True | data['Rooms'].isna())
missing = data[numeric]

imputer = KNNImputer(n_neighbors=5)
imputer.fit(missing)

missing = imputer.transform(missing)
missing = pd.DataFrame(missing, columns=numeric)

for col in numeric:
    data[col] = missing[col]
    
for col in numeric:
    data[col] = data[col].apply(lambda x: round(x))

In [24]:
print(data.shape)

(3332, 24)

## Save data

Verify that there are no `NaN`s in data.

In [25]:
data.isnull().sum().sum()

0

Remove columns that will not be used further.

In [26]:
data = data.drop(['Title', 
                  'Description', 
                  'Link', 
                  'Property', 
                  'City', 
                  'Currency', 
                  'Date'], axis=1)

Take a last peek at the data.

In [27]:
data.head()

,District,Amount,Seller,Area,Rooms,Bathrooms,Parking,Garden,Balcony,Terrace,Floor,New,Estate,Townhouse,Apartment,Land,Studio
0,pradnik czerwony,403072,realtor,43,2,1,covered,False,False,True,True,True,False,False,False,True,False
1,pradnik bialy,600000,realtor,57,3,1,street,False,False,False,False,False,False,False,False,False,False
2,biezanow,371966,realtor,52,3,1,garage,False,True,False,False,True,False,False,False,False,False
3,nowa huta,349000,realtor,47,2,1,no parking,False,False,False,False,True,False,False,False,False,False
4,pradnik bialy,370635,realtor,34,2,1,garage,False,True,False,True,True,False,False,False,True,False

Save it for further analysis.

In [28]:
data.to_csv('../flats-data/cleaned_data.csv', index=False)